Revit 2024 API
DuctSizes.Dispose Method
Releases all resources used by the DuctSizes
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
DuctSizes Class
Autodesk.Revit.DB.Mechanical Namespace